TexasInstruments/f29h85x-mcal/drivers/BSW_Stubs/Os/src/Os.c
typedef enum
{
    SSU_STACK1 = 1,
    SSU_STACK2 = 2,
    SSU_STACK3 = 3,
    SSU_STACK4 = 4,
    SSU_STACK5 = 5,
    SSU_STACK6 = 6,
    SSU_STACK7 = 7
} SSU_StackType;

typedef enum{
    SSU_LINK0   = 0,
    SSU_LINK1   = 1,
    SSU_LINK2   = 2,
    SSU_LINK3   = 3,
    SSU_LINK4   = 4,
    SSU_LINK5   = 5,
    SSU_LINK6   = 6,
    SSU_LINK7   = 7,
    SSU_LINK8   = 8,
    SSU_LINK9   = 9,
    SSU_LINK10  = 10,
    SSU_LINK11  = 11,
    SSU_LINK12  = 12,
    SSU_LINK13  = 13,
    SSU_LINK14  = 14,
    SSU_LINK15  = 15,
} SSU_LinkType;
 /*********************************************************************************************************************
 * Exported Object Definitions
 *********************************************************************************************************************/
#define OS_START_SEC_CODE
#include "Os_MemMap.h"

const Os_CfgType *Os_CfgPtr = &OS_INIT_CONFIG_PC;

/*********************************************************************************************************************
 * Local Object Definitions
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Local Function Prototypes
 *********************************************************************************************************************/

/** \brief Initialize the PIPE control registers by setting them to a known state.
 *
 * This function initializes the PIPE control registers. After globally disabling interrupts and enabling the PIPE, it
 * clears all of the PIE interrupt enable bits and interrupt flags.
 *
 * \param[in] CfgPtr Os config structure
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
static FUNC(void,OS_CODE) OS_ISRInit(const Os_CfgType *CfgPtr);

#if(STD_ON == OS_COUNTER_ENABLE)
/** \brief Initialize the  OS counter.
 *
 * This function initializes the OS counter by configuring the CPU2 timer.
 *
 * \param[in] CounterCfg Counter config structure
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
static FUNC(void,OS_CODE) OS_CounterInit(const Os_CounterCfgType *CounterCfg);
#endif

/** \brief Initialize the PIPE control registers by setting them to a known state.
 *
 * This function initializes the PIPE control registers. After globally disabling interrupts and enabling the PIPE, it
 * clears all of the PIE interrupt enable bits and interrupt flags.
 *
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
static FUNC(void,OS_CODE) Os_InitModule(void);

/** \brief Sets the INT Stack Pointer.
 *
 * CPU will acknowledge the INT only when its current execution stack matched with INTSP
 *
 * \param[in] Stack is the INT stack.
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
static inline void Os_setINTSP(SSU_StackType Stack);

/** \brief Set the Interrupt Link Owner.
 *
 * This function sets the interrupt link owner.
 *
 * \param[in] IntNum specifies the interrupt in question.
 * \param[in] LinkOwner LinkOwner to be set for the interrupt (SSU_LINK0..15)
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
static inline void Os_SetLinkOwner(uint32 IntNum, SSU_LinkType LinkOwner);

/** \brief Global enable for INT and RTINT
 *
 * The function enables the global enable bit to forward INT and RTINT  interrupts  to CPU.
 *
 * \param[in] None
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void Os_GlobalEnable(void);

/** \brief Global disable for INT and RTINT.
 *
 * The function disables the global enable bit to not forward INT and RTINT
 * interrupts  to CPU.
 *
 * \param[in] None
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void Os_DisableGlobal(void);

/** \brief Enables the specified interrupt.
 *
 * The function enables the interrupt which allows the interrupt to participate
 * in priority arbitration.
 *
 * \param[in] IntNum Numeric ID of the interrupt.
 *                         It should be unique & in between 0 and 255 including.
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void Os_EnableInterrupt(uint8 IntNum);

/** \brief Set the Interrupt Priority Level
 *
 * The function sets the priority to the specified interrupt.
 *
 * \param[in] IntNum Numeric ID of the interrupt.
 *                         It should be unique & in between 0 and 255 including.
 * \param[in] Priority Priority level of the interrupt.
 *                     It should be in between 0 and 255 including them.
 *                     Two interrupts can have same priority level.
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void Os_SetIntPriority(uint8 IntNum, uint8 Priority);

/** \brief Set the Interrupt Group Mask
 *
 * The function sets the group mask for the interrupts.Interrupts in a given
 * group do not preempt or nest within other interrupts in the group. Any other
 * group mask chosen for INT_GRP_MASK that is not listed results in using
 * the default group mask of 0xFF (all interrupts can nest).
 *
 * \param[in] GroupMask Group mask (0-255).
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void Os_SetGroupMask(uint8 GroupMask);

/** \brief Set the threshold for RTINT
 *
 * This function sets the interrupt threshold value to group incoming interrupt
 * as RTINT or INT interrupt.
 *
 * \param[in] Threshold Threshold value (0-256)
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void Os_SetThreshold(uint8 Threshold);

#if(STD_ON == OS_COUNTER_ENABLE)
/** \brief Select clock source prescaler
 *
 * The function selects the prescaler for the timer clock source.
 *
 * \param[in] Prescaler Value for the timer 2 clock source prescaler.
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void OS_TimerPrescaler(Os_PrescalerType Prescaler);

