TexasInstruments/f29h85x-mcal/drivers/BSW_Stubs/Os/src/Os.c
/** \brief Starts/restarts CPU timer2.
 *
 * The function starts/restarts the CPU timer2.
 *
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void OS_StartTimer(void);

/** \brief Reloads CPU timer2.
 *
 * The function reloads the CPU timer2.
 *
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void OS_ReloadTimer(void);

/** \brief Disables CPU timer interrupt.
 *
 * This function disables the CPU timer interrupt.
 *
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void OS_TimerDisableInterrupt(void);

/** \brief Sets CPU timer period.
 *
 * This function sets the CPU timer period count in the register PRD. When the
 * timer register(TIM) decrements to zero, the TIM register is reloaded with the
 * period value contained in the PRD registers, at the start of the next timer
 * input clock cycle (the output of the prescaler).The PRD contents are also
 * loaded into the TIM when you set the timer reload bit (TRB) in TCR.
 *
 * \param[in] PeriodCount is the CPU timer period count.
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void OS_TimerSetPeriod(uint32 PeriodCount);

/** \brief Clears CPU timer overflow flag.
 *
 * This function clears the CPU timer overflow flag.
 *
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void OS_TimerClearOverflowFlag(void);

/** \brief Set CPU timer divide down value.
 *
 * This function sets the TDDRH:TDDR value.
 *
 * \param[in] DivideDown is the count for 1 TICK
 * \param[out] None
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 ******************************************************************************/
static inline void OS_SetTimerDivideDown(uint16 DivideDown);

/** \brief Returns the current CPU timer counter value.
 *
 * This function returns the current CPU timer counter value.
 *
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return Returns the current CPU timer count value.
 * \retval uint32
 *
 ******************************************************************************/
static inline uint32 OS_GetTimerCount(void);

/** \brief Returns CPU timer period register value.
 *
 * This function returns the CPU timer period register value.
 *
 * \param[in] None
 * \param[out] None
 * \pre None
 * \post None
 * \return Returns CPU timer period register value.
 * \retval uint32
 *
 ******************************************************************************/
static inline uint32 OS_GetPeriodCount(void);
#endif

/*********************************************************************************************************************
 *  Local Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/
 
/*********************************************************************************************************************
 *  External Functions Definition
 *********************************************************************************************************************/

/* CAT2 ISR common function implementation */
void Os_IsrCat2(Os_IntIdType InterruptId)
{
    uint8 i=0;
    for(i=0;i<OS_CFG_MAX_ISR;i++)
    {
        if((Os_CfgPtr->isr_cfg[i].int_id == InterruptId) && (Os_CfgPtr->isr_cfg[i].int_category == CATEGORY_2))
        {
            /* Call the ISR corresponding to the InterruptId. */
            (Os_CfgPtr->isr_cfg[i].isr_funcptr)();
            break;
        }
    }
}

FUNC(void,OS_CODE) Os_StartOS(void)
{
    /* Initialize the interrupt vector table and configure the interrupts */
    OS_ISRInit(Os_CfgPtr); 
    /* Timer2 Counter initialization */
#if(STD_ON == OS_COUNTER_ENABLE)
    OS_CounterInit(&(Os_CfgPtr->counter_cfg[0])); /* Initializing OS counter */
#endif

}

#if(STD_ON == OS_COUNTER_ENABLE)

FUNC(StatusType,OS_CODE) GetCounterValue(Os_CounterIdType CounterId, Os_TickRefType Value)
{
    *Value = OS_GetPeriodCount() - OS_GetTimerCount();
    return (StatusType)E_OK;
}

FUNC(StatusType,OS_CODE) GetElapsedValue(Os_CounterIdType CounterId,Os_TickRefType Value,Os_TickRefType ElapsedValue)
{
    Os_TickType cur_val ;
    cur_val =  OS_GetPeriodCount() - OS_GetTimerCount();
    if (cur_val < *Value)
    {
        /* Counter overflow occurred */
        cur_val       = OS_GetPeriodCount() + (cur_val - *Value) + 1U ;
        *ElapsedValue = cur_val;
    }
    else
    {
        /* No overflow */
        *ElapsedValue = (cur_val - *Value);
    }
    return (StatusType)E_OK;
}

#endif

/**********************************************************************************************************************
 *  Local Functions Definition
 *********************************************************************************************************************/
#if(STD_ON == OS_COUNTER_ENABLE)
static FUNC(void,OS_CODE) OS_CounterInit(const Os_CounterCfgType *CounterCfg)
{
    OS_TimerDisableInterrupt(); /* Interrupt is disabled */
    OS_TimerClearOverflowFlag(); /* Clear the overflow flag */
    OS_TimerPrescaler(OS_TIMER2CLK_DIV_1);
    /* Setting 1TICK = 1US (micro-second) with SYSCLK as the timer clock source */
    OS_SetTimerDivideDown(TIMERDIVIDEDOWN_PERTICK); 
    OS_TimerSetPeriod(CounterCfg->max_timercount); /* Set the counter value in period register */
    OS_ReloadTimer(); /* Reloads the timer which loads the values in TIM,TPR and TPRH registers.*/
    OS_StartTimer(); /* Start the timer */
}
#endif

static FUNC(void,OS_CODE) Os_InitModule(void)
{
    /* Initialize the MMR registers */
    HWREG(PIPE_BASE + PIPE_O_MMR_CLR) = 0x3U;

    /* Initialize the memory and wait for completion */
    HWREG(PIPE_BASE + PIPE_O_MEM_INIT) = PIPE_MEM_INIT_KEY | 0x3U;
    while(HWREG(PIPE_BASE + PIPE_O_MEM_INIT_STS) != 0x2U);

    /*Set INTSP to STACK2 */
    Os_setINTSP(SSU_STACK2);

    MCAL_LIB_EINT;
    /* Enables global interrupt. */
    Os_GlobalEnable();

