TexasInstruments/f29h85x-mcal/drivers/BSW_Stubs/Os/src/Os.c
}

static FUNC(void,OS_CODE) OS_ISRInit(const Os_CfgType *CfgPtr)
{  
    if(CfgPtr != NULL_PTR)
    {
        uint8 i=0;
        
        /* Disable INT and RTINT by disabling global enable key.*/
        Os_DisableGlobal();

        /* Initialize the PIPE control registers.*/
        Os_InitModule();

        /* Configure RTINT threshold */
        Os_SetThreshold(CfgPtr->threshold);

        /* Configure the group mask */
        Os_SetGroupMask(DISABLE_GROUP_MASK); /* Disable interrupt nesting.*/

        /* Configure the interrupts */
        for(i=0;i< OS_CFG_MAX_ISR;i++)
        {
            /* Set all link owner of all interrupts to LINK2 */
            Os_SetLinkOwner((CfgPtr->isr_cfg[i].int_id),SSU_LINK2);

            /* ISR to be called when an interrupt occurs. */
            HWREG(PIPE_BASE + PIPE_O_INT_VECT_ADDR(CfgPtr->isr_cfg[i].int_id)) = (uint32)(CfgPtr->isr_cfg[i].int_funcptr);

            /* Assign the priority level and enable the interrupt.*/         
            Os_SetIntPriority(CfgPtr->isr_cfg[i].int_id,CfgPtr->isr_cfg[i].int_priority);
            Os_EnableInterrupt(CfgPtr->isr_cfg[i].int_id);
        }
    }
}

static inline void
Os_setINTSP(SSU_StackType Stack)
{
    HWREG(PIPE_BASE + PIPE_O_INTSP) = Stack;
}

static inline void
Os_SetLinkOwner(uint32 IntNum, SSU_LinkType LinkOwner)
{
    uint32 base = PIPE_BASE + PIPE_O_INT_LINK_OWNER(IntNum);
    HWREG(base) = (HWREG(base) & 0xF0U) | (uint8)LinkOwner;
}

static inline void Os_GlobalEnable(void)
{
    HWREG(PIPE_BASE + PIPE_O_GLOBAL_EN) = (0x3U | PIPE_GLOBAL_EN_KEY);
}

static inline void Os_DisableGlobal(void)
{
    HWREG(PIPE_BASE + PIPE_O_GLOBAL_EN) = PIPE_GLOBAL_EN_KEY;
}

static inline void Os_EnableInterrupt(uint8 IntNum)
{
    HWREG(PIPE_BASE + PIPE_O_INT_CTL_L(IntNum)) = PIPE_INT_CTL_L_EN;
}

static inline void Os_SetIntPriority(uint8 IntNum, uint8 Priority)
{
    uint32 base = PIPE_BASE + PIPE_O_INT_CONFIG(IntNum);
    HWREG(base) = (HWREG(base) & ~PIPE_INT_CONFIG_PRI_LEVEL_M) | Priority;
}

static inline void Os_SetGroupMask(uint8 GroupMask)
{
    HWREG(PIPE_BASE + PIPE_O_INT_GRP_MASK) = GroupMask;
}

static inline void Os_SetThreshold(uint8 Threshold)
{
    HWREG(PIPE_BASE + PIPE_O_RTINT_THRESHOLD) = Threshold;
}

#if(STD_ON == OS_COUNTER_ENABLE)
static inline void OS_TimerPrescaler(Os_PrescalerType Prescaler)
{
    /* Clear TSS bit of register TCR */
    HWREG(CPUSYS_BASE + SYSCTL_O_TMR2CLKCTL) = \
    (HWREG(CPUSYS_BASE + SYSCTL_O_TMR2CLKCTL) & \
        ~(SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_M)) | \
        ((uint8)Prescaler << SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_S);
}

static inline void OS_StartTimer(void)
{
    /* Clear TSS bit of register TCR */
    HWREGH(CPUTIMER2_BASE + CPUTIMER_O_TCR) &= ~CPUTIMER_TCR_TSS;
}

static inline void OS_ReloadTimer(void)
{
    /* Reload the timer counter. */
    HWREGH(CPUTIMER2_BASE + CPUTIMER_O_TCR) |= CPUTIMER_TCR_TRB;
}

static inline void OS_TimerDisableInterrupt(void)
{
    /* Clear TIE bit of TCR register */
    HWREGH(CPUTIMER2_BASE + CPUTIMER_O_TCR) &= ~CPUTIMER_TCR_TIE;
}

static inline void OS_TimerSetPeriod(uint32 PeriodCount)
{
    /* Load the period Count in the PRD register. */
    HWREG(CPUTIMER2_BASE + CPUTIMER_O_PRD) = PeriodCount;
}

static inline void OS_TimerClearOverflowFlag(void)
{
    /* Set TIF bit of TCR register */
    HWREGH(CPUTIMER2_BASE + CPUTIMER_O_TCR) |= CPUTIMER_TCR_TIF;
}

static inline void OS_SetTimerDivideDown(uint16 DivideDown)
{
    /* Sets the CPU Timer divide down value */
    HWREGH(CPUTIMER2_BASE + CPUTIMER_O_TPRH) = DivideDown >> 8U;
    HWREGH(CPUTIMER2_BASE + CPUTIMER_O_TPR) = (DivideDown & CPUTIMER_TPR_TDDR_M) ;
}

static inline uint32 OS_GetTimerCount(void)
{
    /* Get the TIMH:TIM registers value */
    return(HWREG(CPUTIMER2_BASE + CPUTIMER_O_TIM));
}

static inline uint32 OS_GetPeriodCount(void)
{
    /* Get the PRDH:PRD registers value */
    return (HWREG(CPUTIMER2_BASE + CPUTIMER_O_PRD));
}
#endif

#define OS_STOP_SEC_CODE
#include "Os_MemMap.h"
/*********************************************************************************************************************
 *  End of File: Os.c
 *********************************************************************************************************************/
